//=============================================================================
//
// デバッグ表示処理 [CDebugproc.h]
// Author : 長岡 和真
//
//=============================================================================
#ifndef _CDEBUGPROC_H_
#define _CDEBUGPROC_H_
//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
//*****************************************************************************
// 構造体定義
//*****************************************************************************


class CDebugproc
{
public: 
	CDebugproc(void);
	~CDebugproc(void);

	HRESULT InitDebugProc(LPDIRECT3DDEVICE9 m_pD3DDevice);
	void UninitDebugProc(void);
	void UpdateDebugProc(void);
	static void DrawDebugProc(int x,int y);
	static void PrintDebugProc(const char *fmt,...);

	LPD3DXFONT	m_pD3DXFont;		// フォントへのポインタ
	char m_aStrDebug[1024];
	char m_workbuf[1024];

};


#endif