//=============================================================================
//
//  [CList.h]
// Author : 長岡和真
//
//=============================================================================
#ifndef	_CLIST_H
#define _CLIST_H
//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "main.h"
#include "CScene.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
//*****************************************************************************
// 構造体定義
//*****************************************************************************

class CList
{
	public:
	CList(void);
	~CList(void);

	HRESULT Init(void);
	void	Uninit(void);
	void	Update(void);
	static void SetListAddress(CScene *m_pAddress);
	static int m_num;
	static CScene* m_pListAddress[];
	static int GetNum(void);
	static CScene* GetListAddress(int num);
	CList *GetListAdd(void);

	private:


};


#endif