#ifndef __GAME_H__
#define __GAME_H__

//==========================================-
//	プロトタイプ宣言
//==========================================-
//=============================
//	ゲームの初期化（一回のみ）
//引数：無
//戻値：無
//=============================
void GameInit(void);
//=============================
//	ゲームの初期化（シーン開始時）
//引数：無
//戻値：無
//=============================
void GameInitScene(void);
//=============================
//	ゲームの終了処理（一回のみ）
//引数：無
//戻値：無
//=============================
void GameUnInit(void);
//=============================
//	ゲームの終了処理（シーン終了時）
//引数：無
//戻値：無
//=============================
void GameUnInitScene(void);
//=============================
//	ゲームの更新処理
//引数：無
//戻値：無
//=============================
void GameUpdate(void);
//=============================
//	ゲームの描画処理
//引数：無
//戻値：無
//=============================
void GameDraw(void);

#endif//__GAME_H__