#ifndef __PLAYER_H__
#define __PLAYER_H__

//==========================================-
//	インクルード
//==========================================-
#include "aplication.h"

//==========================================-
//	構造体
//==========================================-
typedef struct _PLAYER
{
    int posX, posY;         // プレイヤー座標
    DIRECTION direction;

} PLAYER;

typedef struct
{
	float	fPosX;	//X座標
	float	fPosY;	//Y座標
} STR_PLAYER_INFO;	//プレーヤー構造体

//==========================================-
//	プロトタイプ宣言
//==========================================-
//=============================
//	プレーヤー情報取得関数
//引数：無
//戻値：PLAYER*		プレーヤー情報ポインタ
//=============================
PLAYER* GetPlayerInfo(void);

//=============================
//	プレーヤーの初期化
//引数：無
//戻値：無
//=============================
void PlayerInit(void);

//=============================
//	プレーヤーの終了処理
//引数：無
//戻値：無
//=============================
void PlayerUnInit(void);

//=============================
//	プレーヤーの更新処理
//引数：無
//戻値：無
//=============================
void PlayerUpdate(void);

#endif//__PLAYER_H__