#ifndef __RESULT_H__
#define __RESULT_H__

//==========================================-
//	プロトタイプ宣言
//==========================================-
//=============================
//	リザルトの初期化（一回のみ）
//引数：無
//戻値：無
//=============================
void ResultInit(void);
//=============================
//	リザルトの初期化（シーン開始時）
//引数：無
//戻値：無
//=============================
void ResultInitScene(void);
//=============================
//	リザルトの終了処理（一回のみ）
//引数：無
//戻値：無
//=============================
void ResultUnInit(void);
//=============================
//	リザルトの終了処理（シーン終了時）
//引数：無
//戻値：無
//=============================
void ResultUnInitScene(void);
//=============================
//	リザルトの更新処理
//引数：無
//戻値：無
//=============================
void ResultUpdate(void);
//=============================
//	リザルトの描画処理
//引数：無
//戻値：無
//=============================
void ResultDraw(void);

#endif//__RESULT_H__