#ifndef __TITLE_H__
#define __TITLE_H__

//==========================================-
//	プロトタイプ宣言
//==========================================-
//=============================
//	タイトルの初期化（一回のみ）
//引数：無
//戻値：無
//=============================
void TitleInit(void);
//=============================
//	タイトルの初期化（シーン開始時）
//引数：無
//戻値：無
//=============================
void TitleInitScene(void);
//=============================
//	タイトルの終了処理（一回のみ）
//引数：無
//戻値：無
//=============================
void TitleUnInit(void);
//=============================
//	タイトルの終了処理（シーン終了時）
//引数：無
//戻値：無
//=============================
void TitleUnInitScene(void);
//=============================
//	タイトルの更新処理
//引数：無
//戻値：無
//=============================
void TitleUpdate(void);
//=============================
//	タイトルの描画処理
//引数：無
//戻値：無
//=============================
void TitleDraw(void);

#endif//__TITLE_H__